app/controllers/api_controller.rb

  def post
    if (params[:username].blank? || params[:password].blank? || params[:port_key].blank?)
      @customer = Customer.new
      render :layout => false
    else

      @lead_provider = LeadProvider.find_by_username_and_password(params[:username], params[:password])
      @portfolio = Portfolio.find_by_port_key(params[:port_key])
---
SELECT * FROM `lead_providers` WHERE (`lead_providers`.`username` = 'leadprovider' AND `lead_providers`.`password` = 'leadprovider') LIMIT 1
SELECT * FROM `portfolios` WHERE (`portfolios`.`port_key` = 'CGAOFZJ7HE') LIMIT 1